DS/src/Documents/ФиксацияПосещений/ФиксацияПосещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФиксацияПосещений</name>
  <registerRecords>InformationRegister.СтатусыАбонементов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПосещений</registerRecords>
  <attributes>
    <name>Курс</name>
    <type>
      <types>DocumentRef.Курс</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Посещения</name>
    <attributes>
      <name>Человек</name>
      <type>
        <types>CatalogRef.Люди</types>
      </type>
    </attributes>
    <attributes>
      <name>Абонемент</name>
      <type>
        <types>DocumentRef.Абонемент</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DS/src/AccumulationRegisters/ОстаткиПосещений/ОстаткиПосещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПосещений</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.Абонемент</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DS/src/Documents/ФиксацияПосещений/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФиксацияПосещенийПосещения.Абонемент
	|ИЗ
	|	Документ.ФиксацияПосещений.Посещения КАК ФиксацияПосещенийПосещения
	|ГДЕ
	|	ФиксацияПосещенийПосещения.Ссылка = &Ссылка
	|	И ФиксацияПосещенийПосещения.Абонемент.ВидАбонемента.КоличествоЗанятий > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = Движения.ОстаткиПосещений.ДобавитьРасход();
		Запись.Абонемент = Выборка.Абонемент;
		Запись.Количество = 1;
		
	КонецЦикла;
	
	Движения.ОстаткиПосещений.Записать();
	
	Запрос = Новый Запрос;

КонецПроцедуры
